Jmeter/login_performance_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="活动策划管理平台 - 登录接口性能测试" enabled="true">
      <stringProp name="TestPlan.comments">登录接口性能测试计划，包含正常和异常场景</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <stringProp name="TestPlan.name">活动策划管理平台 - 登录接口性能测试</stringProp>
      <elementProp name="TestPlan.user_defined_variables" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="baseUrl" guiclass="Argument" testclass="Argument" testname="baseUrl">
            <stringProp name="Argument.name">baseUrl</stringProp>
            <stringProp name="Argument.value">http://localhost:8080/EventPlanning_Management</stringProp>
            <booleanProp name="Argument.always_encoded">false</booleanProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="登录性能测试线程组" enabled="true">
        <stringProp name="ThreadGroup.comments">模拟多用户并发登录场景</stringProp>
        <elementProp name="ThreadGroup.main_controller" guiclass="LoopController" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <stringProp name="ThreadGroup.start_time">0</stringProp>
        <stringProp name="ThreadGroup.end_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">0</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.name">登录性能测试线程组</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 请求默认值" enabled="true">
          <elementProp name="HTTPSampler.Arguments" guiclass="HTTPArgumentsPanel" testclass="HTTPArguments" testname="用户定义的变量" enabled="true">
            <collectionProp name="HTTPArguments.arguments"></collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.name">HTTP 请求默认值</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP 信息头管理器" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" guiclass="Header" testclass="Header" testname="Content-Type">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/x-www-form-urlencoded; charset=UTF-8</stringProp>
            </elementProp>
            <elementProp name="Accept" guiclass="Header" testclass="Header" testname="Accept">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json, text/javascript, */*; q=0.01</stringProp>
            </elementProp>
          </collectionProp>
          <stringProp name="TestPlan.name">HTTP 信息头管理器</stringProp>
        </HeaderManager>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 数据文件设置" enabled="true">
          <stringProp name="filename">login_test_data.csv</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">id,username,password,roleId,description</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="share">share.all</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <stringProp name="TestPlan.name">CSV 数据文件设置</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="登录接口请求" enabled="true">
          <stringProp name="HTTPSampler.domain">${baseUrl}</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/login</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <elementProp name="HTTPSampler.Arguments" guiclass="HTTPArgumentsPanel" testclass="HTTPArguments" testname="参数" enabled="true">
            <collectionProp name="HTTPArguments.arguments">
              <elementProp name="username" guiclass="HTTPArgument" testclass="HTTPArgument" testname="username">
                <stringProp name="Argument.name">username</stringProp>
                <stringProp name="Argument.value">${username}</stringProp>
                <booleanProp name="Argument.always_encoded">true</booleanProp>
              </elementProp>
              <elementProp name="password" guiclass="HTTPArgument" testclass="HTTPArgument" testname="password">
                <stringProp name="Argument.name">password</stringProp>
                <stringProp name="Argument.value">${password}</stringProp>
                <booleanProp name="Argument.always_encoded">true</booleanProp>
              </elementProp>
              <elementProp name="roleId" guiclass="HTTPArgument" testclass="HTTPArgument" testname="roleId">
                <stringProp name="Argument.name">roleId</stringProp>
                <stringProp name="Argument.value">${roleId}</stringProp>
                <booleanProp name="Argument.always_encoded">true</booleanProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="TestPlan.name">登录接口请求</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="聚合报告" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="TestPlan.name">聚合报告</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="TestPlan.name">察看结果树</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="图形结果" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="TestPlan.name">图形结果</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="用表格查看结果" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="TestPlan.name">用表格查看结果</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>